#our database configuration
DB_CREDS = {
    'host':'localhost',
    'user':'root',
    'pass':'eleni123',
    'db':'NewsCrawler'
}

#list of words used in notebooks folder, 20 words in each list
pos = ['καλυτερα','ενισχυση','ανοδο','μουσειο','στηριξη','δημιουργια','ευκαιρια','φεστιβαλ','μουσικη','τουρισμου','αναπτυξη', 'ανακαμψης', 'αισιοδοξα','καλος','χαρα','προσληψεις','εγκαινιαστηκε','ανακαλυψη','επιτυχια','καλη','συνεργασια']
neg = ['κριση','μετρων','προσπαθεια','προστασιας','ελεγχο,''κινδυνο','χρειαζεται','ζητημα','αναγκη','μειωση','κρισης', 'προβλημα', 'ανησυχια','λυπη','συγχυση','επιθεση','πονο','υφεση','ακυρωση','προβληματα']

