#our database configuration
DB_CREDS = {
    'host':'localhost',
    'user':'root',
    'pass':'eleni123',
    'db':'NewsCrawler'
}

#words to filter from our text
stop_words = {'και', 'το', 'του', 'να', 'η', 'της', 'την', 'με', 'για', 'που', 
              'απο', 'ο', 'σε', 'των', 'τα', 'θα', 'ειναι', 'στο', 'οι', 'τον', 
              'στην', 'τους', 'τη', 'οτι', 'τις', 'δεν', 'μια', 'στη', 'ενα', 'εχει', 
              'στις', 'αλλα', 'στα', 'στον', 'μας', 'οπως', 'αυτο', 'εχουν', 'πως', 'ηταν', 
              'κατα', 'κ', 'ενω', 'ως', 'αν', 'δυο', 'πρεπει', 'αυτη', 'μετα', 'πολυ', 'οποια', 
              'ειχε', 'πιο', 'καθως', 'συμφωνα', 'μπορει', 'στους', 'ευρω', 'μεχρι', 'μεσα', 
              'ομως', 'σημερα', 'επισης', 'οταν', 'καθε', 'μονο', 'χρονια', 'μου', 'εως', 'προς', 
              'ελλαδα', 'νεα', 'τι', 'ακομη', 'οποιο', 'μετρα', 'ολα', 'χωρα', 'κυβερνηση', 'ειπε', 
              'μεταξυ', 'χωρις', 'οπου', 'υπαρχει', 'κι', 'ενας', 'πριν', 'αυτα', 'σας', 'πρωτη', 
              'οχι', 'κανει', 'εναν', 'οσο', 'υγειας', 'λογω', 'ακομα', 'ωστε', 'κατι', 'ηδη', 'τοσο', 
              'περιπου', 'τωρα', 'μην', 'πανω', 'ωστοσο', 'γινει', 'χωρες', 'μεσω', 'γιατι', 'δηλωσε', 
              'ετσι', 'εργασιας', 'ειχαν', 'μπορουν', 'εχουμε', 'ενος', 'τελος'}