# coding: utf-8
from matplotlib import pyplot as plt
import pandas as pd
import collections
from collections import Counter,defaultdict,OrderedDict,namedtuple 
from wordcloud import WordCloud, STOPWORDS, ImageColorGenerator
import sys
sys.path.insert(1, '/Users/elenikaranikola/Desktop/NewsBackend')
from utilities import removeAccents,normalize

def finalNormalize (i):
    text = normalize(i)
    stop_words="και, το, του, της, να, η, την, με, για, που, απο, ο, σε, τα, των, στο, θα, ειναι, τον, στην, οι, τη, τους, τις, οτι, δεν, μια, στη, ενα, εχει, στις, αλλα, στα, στον, μας, οπως, αυτο, πως, εχουν, ηταν, κ, κατα, ενω, ως, μετα, δυο, ευρω, αν, ειχε, οποια, αυτη, συμφωνα, πιο, πολυ, καθως, πρεπει, μεχρι, ελλαδα, τι, μπορει, σημερα, στους, μου, χρονια, μεσα, ομως, οταν, καθε, μονο, προς, επισης, νεα, εως, οποιο, χωρα, ακομη, ολα, μεταξυ, πριν, κι, χωρις, ειπε, οπου, σας, πρωτη, αυτα, οχι, ενας, υπαρχει, τωρα, κανει, εναν, κυβερνηση, οσο, κατι, κοσμο, τοσο, ηδη, ακομα, λογω, μην, ωστοσο, περιπου, μεσω, πανω, δηλωσε, ωστε, μετρα, γιατι, γινει, μαζι, εχουμε, τελος, αποφαση, ειχαν, α, πλεον, ετσι"
    short_words="ς, ψ, λ, ι, ν, η, ξ, τ, δ, ο, σ, π, κ, γ, φ, υ, ρ, α, μ, ε, χ, β, θ, ω, ζ, ξε, λλ, αο, γλ, μχ, ρη, εφ, υα, νη, χη, ντ, φλ, φω, ιθ, ρχ, οβ, σα, μω, δτ, αχ, ιγ, εν, χε, μμ, θη, νε, ιλ, νπ, βγ, ττ, αβ, πω, ευ, σγ, ιη, ιο, γα, πι, αυ, υψ, ιζ, φη, υβ, βυ, πη, εο, ξο, χω, ρυ, ου, ζη, κι, τμ, κο, φρ, βμ, χυ, ακ, χλ, εσ, βε, ρο, γη, υπ, ην, χχ, υγ, μς, σφ, λη, ρμ, λδ, στ, ζι, λυ, ετ, μο, πχ, εγ, ης, δν, πρ, λπ, μι, φε, φπ, υς, σο, τλ, σι, ει, γγ, κφ, αφ, οη, οπ, νδ, γδ, δρ, ζα, γε, κα, σκ, γι, εη, ιχ, θσ, πγ, ος, ξβ, κρ, οα, οφ, φο, δα, ιν, ρτ, πθ, πα, υκ, δς, βτ, μη, κω, θι, χτ, ια, λα, λε, εε, σδ, σπ, αδ, ηι, χρ, πζ, ρρ, υε, εξ, λο, δκ, το, οδ, αε, συ, δο, χα, ωσ, ικ, βς, πμ, ψη, απ, φυ, φβ, τε, κκ, ζο, δυ, γω, εδ, ηπ, ιβ, σμ, θυ, ηε, αν, φι, οε, θα, ζυ, ψυ, ρω, δω, γν, γρ, θε, ψε, πλ, αμ, υο, ολ, ις, ωα, ημ, πβ, εθ, σω, ον, αα, ερ, νο, ιω, δξ, πο, κθ, ισ, τκ, ψω, ηω, μτ, ξι, τυ, νκ, οκ, κβ, εα, θρ, ορ, βα, ιπ, εκ, σς, ηα, ομ, ωχ, ππ, ρν, τη, μρ, ασ, ωρ, ιε, μυ, οτ, υν, κη, νι, κμ, βλ, βρ, δε, ως, τθ, νυ, εχ, πτ, κε, λς, αι, γπ, ρα, τι, ζω, σχ, εβ, βκ, αγ, με, ας, τζ, υφ, βο, αω, ρε, δβ, ξη, να, βι, πυ, νβ, ιφ, πε, μβ, τα, γτ, ατ, οο, αρ, ελ, σσ, νμ, νω, χι, τβ, ιι, θω, λι, σε, ββ, πδ, ηο, εμ, ιδ, τρ, κλ, ηρ, ξω, κδ, μα, νν, μκ, βδ, γς, κυ, οι, ηβ, υι, τω, βη, γυ, λω, τσ, φδ, γκ, τν, πς, κς, δδ, μπ, ρζ, δι, επ, πκ, χο, οζ, αη, αξ, δλ, ες, γο, ων, ιρ, ση, ιμ, αλ, πν, χμ, φα, τς, αζ, ιτ, ηη, ρι, δη, μδ, ωη, τπ, ηλ, αθ, σζ, ηυ, κσι, πωε, ασο, υψη, ποτ, μετ, δηλ, νιη, ασρ, υρη, πελ, εεπ, γκε, γκι, ουμ, παχ, μαο, ρος, υμα, ερφ, πδπ, σφα, απδ, ισθ, βισ, δσα, πεβ, χνα, δρυ, φυο, ευδ, νγκ, ωμα, ταο, ειω, ιμκ, μμε, ιτα, εων, υπο, τσο, γελ, αψυ, τηξ, οτε, ικη, αμκ, χιθ, λιφ, χεκ, δερ, ουτ, ηπα, τεε, βρα, τολ, ακτ, ωμη, κιθ, ραε, ισκ, απς, μολ, ναω, νοη, αιτ, πην, αης, αλλ, αοα, τακ, ημε, εδδ, εκτ, κκκ, εοκ, ιτς, υθι, αρλ, λος, ναμ, στσ, παξ, στε, δαπ, ρλκ, ασκ, ισπ, οφη, υμε, εστ, πως, εια, ροζ, ηνυ, τκο, ερι, ματ, ντο, τηι, ωρο, ρμι, ασθ, φκα, τεν, φαπ, δες, οδε, βθα, ιλο, ιδι, αζκ, ανα, ηκε, ουδ, ντν, βββ, κεδ, εαη, υον, τοο, κηθ, μνα, διε, μμμ, σεφ, ψης, ιγη, απα, στο, τμζ, σεδ, αγς"
    fix_words="ο, η, το, οι, τα, του, τησ, των, τον, την, και, κι, κ, ειμαι, εισαι, ειναι, ειμαστε, ειστε, σου, μου, στο, στον, στη, στην, μα, αλλα, απο, για, προσ, με, σε, ωσ, παρα, αντι, κατα, μετα, θα, να, δε, δεν, μη, μην, επι, ενω, εαν, αν, τοτε, που, πωσ, ποιος, ποια, ποιο, ποιοι, ποιες, ποιων, ποιους, αυτοσ, αυτη , αυτο, αυτοι, αυτων, αυτους, αυτες, αυτα, εκεινος, εκεινη, εκεινο, εκεινοι, εκεινες, εκεινα, εκεινων, εκεινους, οπως, ομως, ισως, οσο, οτι, σαν, εγω, εσυ, καλα, εχω, ενος, ποτε, ουτε, ολη, ισως, λοιπον, αφου, λιγο, αυτες, πολλα, παντα, εχω, εχεις, εχει, ολοι, κανεις, καμια, κανενα, εδώ, ιδια, ιδια, ιδιος, εδω, καποιος, καποια, επειδη, καλο, πολλες, πολλα, μολις, μια, μιας, ενα, αλλη, αλλος, αλλα, σχεδον, λεει, κανουν, κανει, πίσω, αλλο, ολες, κυριως, χθες, προκειται, αλλων, μπορουν, οποιος, οποιο, οποια, συνεχεια, μερος, δηλαδη, ακριβως, μπορεις, μπορει, δινει, εξω, κανω, εκανε, ολους, μαλιστα, νεο, θελει, θελω, τελικα, ειτε, σχετικα, τονισε, βρισκεται, ανεφερε, αρκετα, εχετε, εγραψε, εγινε, αφορα, επιπλεον, σημειωσαν, προκειμενου, αναμενεται, παραλληλα, ανακοινωση, βρισκονται, συνολικα, περιπτωση, υπαρχουν, μεγαλο, προσθεσε, πηγη, οποιες, γινεται, μεγαλη, ανακοινωσε, αναφερει, τουλαχιστον, διαβαστε, συμβαινει, δειτε, φαινεται, γινεται, αναφερει, γραψτε, συχνα, ανακατευουμε, ριχνουμε, βαζουμε, προσθετουμε, ριχνουμε, ψηνουμε, σερβιρουμε, αφηνουμε, σοταρουμε, χτυπαμε, τοποθετουμε, περισσοτερο, περισσοτερες, αποσυρουμε, προσφερει, αλλες, αποτελει, επιτρεπει, προσβαση, διαθετει, χρηση, χρηστες, χρηστων, μπορουσε, τροπο, σημαινει, ανακατευοντας, κρυωσει, βραζουμε, κοβουμε, οσα, συγκεκριμενα, υπογραμμισε, υπαρξει, απε, μπε, αυτος, εδωσε, πηρε, παλι, εκτος, καταφερε, παρει"
    filtered_sentence = list(filter(lambda i: i not in stop_words, text))
    second_filter = list(filter(lambda i: i not in short_words, filtered_sentence))
    third_filter = list(filter(lambda i: i not in fix_words, second_filter))
    return(third_filter)

my_input = sys.argv[1]

final = finalNormalize(my_input)

res = ""
for x in final:
    res = res + " " + x
print(" ")
print("RESULTS!!!")
print(" ")
print(res)